Repository: Toni500github/customfetch
Catalog: po/*.po
Languages: it_it

source: customfetch config folder was not found, Creating folders at {}!
it_it: cartella di configurazione di customfetch non è stata trovata, Creando la cartella in {}!

source: config file {} not found, generating new one
it_it: file di configurazione {} non trovato, generandone uno nuovo

source: Parsing config file '{}' failed: {} (error occurred at line {} column {})
it_it: Parsificazione del file '{}' fallito: {} (errore accaduto alla linea {} colonna {})

source: the config array percentage-colors doesn't have 3 colors for being used in percentage tag and modules. Backing up to green, yellow and red
it_it: L'array di configurazione 'percentage-colors' non ha 3 colori per essere usati nel tag della percentuale e moduli. Utilizzeremo verde, giallo e rosso

source: an element of the array '{}' is not a string
it_it: un elemento dell'array '{}' non è una stringa

source: Unable to load image '{}'
it_it: Impossibile caricare immagine '{}'

source: The image backend '{}' isn't supported, only 'kitty' and 'viu'. Please currently use the GUI mode for rendering the image/gif (use -h for more details)
it_it: Il caricatore di imagine '{}' non è supportato, solo 'kitty' e 'viu'.Al momento usate la modalità GUI per caricare immagine/gif (usare -h per più dettagli)

source: Could not open logo file '{}'
it_it: Non è possibile aprire il logo del file '{}'

source: images are NOT allowed in the android widget at the moment
it_it: le immagini NON sono consentite nel widget di android al momento

source: Background image path '{}' doesn't exist
it_it: La posizione dell'immagine di sfondo '{}' non esiste

source: config file '{}' doesn't exist
it_it: file di configurazione '{}' non esiste

source: Parser: failed to parse layout/ascii art: missing 'm' while using ANSI color escape code in '{}'
it_it: Parser: parsificazione del layout/ascii art fallita: manca 'm' mentre usiamo codice ANSI escape a colori in '{}'

source: ANSI escape code color '\e[{}' should have an rgb type value e.g \e[38;2;255;255;255m
it_it: codice ANSI escape a colori '\e[{}' deve avere un tipo di valore rgb es. \e[38;2;255;255;255m

source: Parser: failed to parse layout/ascii art: missing 'm' while using ANSI color escape code in '\e[{}'
it_it: Parser: parsificazione del layout/ascii art fallita: manca 'm' mentre usiamo codice ANSI escape a colori in '\e[{}'

source: '{}' mode in color '{}' doesn't have close bracket
it_it: modalità '{}' nel colore '{}' non ha la parentesi chiusa

source: 256 true color '{}' works only in terminal
it_it: colore '{}' funziona solo sul terminale

source: PARSER: failed to parse line with color '{}'
it_it: PARSER: parsificazzione della line con colore '{}' fallito

source: {} mode in tag color {} doesn't have close bracket
it_it: la modalità {} nel tag del colore {} non ha un chiudi parentesi

source: percentage tag '{}' doesn't have a comma for separating the 2 numbers
it_it: il tag percentuale '{}' non tiene una virgola per separare i 2 numeri

source: PARSER: Missing tag close bracket {} in string '{}'
it_it: PARSER: tag chiudi parentesi {} mancate nella stringa '{}'

source: seems theme-gtk module name '{}' doesn't have a version number to query. Syntax should be like 'theme_gtkN' which N stands for the version of gtk to query (single number)
it_it: sembra che il modulo theme-gtk con nome '{}' non contiene una versione per fare la query. La sintassi deve essere come 'theme_gtkN' dove N è la versione di gtk per fare la query (numero a singola cifra)

source: invalid disk module name '{}', must be disk(/path/to/fs) e.g: disk(/)
it_it: invalido nome del modulo disco '{}', deve essere come disk(/path/to/fs) e.g: disk(/)

source: Invalid module name: {}
it_it: Nome modulo invalido: {}

source: FATAL: $HOME enviroment variable is not set (how?)
it_it: FATAL: la variabile di ambiente $HOME non è stata imposta (come?)

source: No such enviroment variable: {}
it_it: Variabile di ambiente non esistente: {}

source: Failed to open {}
it_it: Non si è riusciti ad aprite {}

source: Failed to execute the command: {}
it_it: Non si è riusciti ad eseguire il commando: {}

source: Failed to find $HOME, set it to your home directory!
it_it: Non si è riusciti a trovare la variabile di ambiente $HOME, impostala nella cartella della tua /home!

source: Could not open {}
it_it: Non si è riusciti ad aprire {}

source: setmntent() failed. Could not get disk info
it_it: setmntent() failed. Non si è riusciti ad avere le informazioni del disco

source: Failed to get disk info at {}
it_it: Non si è riusciti ad avere le informazioni del disco in {}

source: Failed to parse GPU infos on the path /sys/class/drm/
it_it: Non si è riusciti ad esaminare le info della GPU nelle cartelle di /sys/class/drm/

source: Could not open {} Failed to get RAM infos
it_it: Non si è riusciti ad aprire {} Non si è riusciti ad avere le informazioni della RAM

source: Failed to get OS infos
it_it: Non si è riusciti ad avere le informazioni dell'OS

source: uname() failed: {} Could not get system infos
it_it: uname() failed: {} Non si è riusciti ad avere le informazioni del sistema

source: sysinfo() failed: {} Could not get system infos
it_it: sysinfo() failed: {} Non si è riusciti ad avere le informazioni del sistema

source: customfetch could not detect a gtk configuration file. customfetch will use the much-slower gsettings.
it_it: customfetch non è riuscito ad identificare il file di configurazione gtk. utilizzeremo il comando lento gsettings.

source: If there's a file in a standard location that we aren't detecting, please file an issue on our GitHub.
it_it: Se c'è un file in una luogo standard che non siamo riusciti ad identificare, per favore compilare un issue sul nostro Github

source: You can disable this warning by disabling slow-query-warnings in your config.toml file.
it_it: Puoi disabilitare questo avvertimento disabilitando 'slow-query-warnings' nel tuo file di configurazione

source: getpwent failed: {} Could not get user infos
it_it: getpwent() failed: {} Non si è riusciti ad avere le informazioni dell'utente
